{"class_name": "Functional", "config": {"name": "model_21", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 13], "dtype": "float32", "sparse": false, "ragged": false, "name": "y_profile"}, "registered_name": null, "name": "y_profile", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "concatenate_23", "trainable": true, "dtype": "float32", "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, 13], [null, 13], [null, 13]]}, "name": "concatenate_23", "inbound_nodes": [[["y_profile", 0, 0, {}], ["y_profile", 0, 0, {}], ["y_profile", 0, 0, {}]]]}, {"module": "qkeras.qlayers", "class_name": "QDense", "config": {"name": "hidden_dense", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "qkeras.qlayers", "class_name": "QInitializer", "config": {"initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "use_scale": true, "quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 4, "integer": 0, "symmetric": 0, "alpha": 1.0, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}}, "registered_name": "QInitializer"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "qkeras.qlayers", "class_name": "Clip", "config": {"min_value": -1, "max_value": 1}, "registered_name": "Clip"}, "bias_constraint": {"module": "qkeras.qlayers", "class_name": "Clip", "config": {"min_value": -1, "max_value": 1}, "registered_name": "Clip"}, "kernel_quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 4, "integer": 0, "symmetric": 0, "alpha": 1.0, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}, "bias_quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 4, "integer": 0, "symmetric": 0, "alpha": 1.0, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}, "kernel_range": null, "bias_range": null}, "registered_name": "QDense", "build_config": {"input_shape": [null, 39]}, "name": "hidden_dense", "inbound_nodes": [[["concatenate_23", 0, 0, {}]]]}, {"module": "qkeras.qlayers", "class_name": "QDense", "config": {"name": "output_dense", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "qkeras.qlayers", "class_name": "QInitializer", "config": {"initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "use_scale": true, "quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 4, "integer": 0, "symmetric": 0, "alpha": 1.0, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}}, "registered_name": "QInitializer"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "qkeras.qlayers", "class_name": "Clip", "config": {"min_value": -1, "max_value": 1}, "registered_name": "Clip"}, "bias_constraint": {"module": "qkeras.qlayers", "class_name": "Clip", "config": {"min_value": -1, "max_value": 1}, "registered_name": "Clip"}, "kernel_quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 4, "integer": 0, "symmetric": 0, "alpha": 1.0, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}, "bias_quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 4, "integer": 0, "symmetric": 0, "alpha": 1.0, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}, "kernel_range": null, "bias_range": null}, "registered_name": "QDense", "build_config": {"input_shape": [null, 10]}, "name": "output_dense", "inbound_nodes": [[["hidden_dense", 0, 0, {}]]]}], "input_layers": [["y_profile", 0, 0]], "output_layers": [["output_dense", 0, 0]]}, "keras_version": "2.15.0", "backend": "tensorflow"}